VA_NAME = "Магика" #м.а.г.и.к.а. (многофункциональный автоматизированный голосовой интеллектуальный компьютерный ассистент)

VA_VER = "1.0"

VA_ALIAS = ("Мага", "Магика", "Маг", "Гика", "Миша", "Гига", "Маша", "Маджа", "Магиня", "Магистр", "Магуля", "Гишка", "Мишка", "Магик", "Магистра", "Гиша", "Машина", "Магни", "Магистресса", "Магин", "Магия", "Мишень", "Мадж", "Магулечка", "Магистресс", "Гишуня", "Мишутка", "Маганя", "Магнус", "Магиша", "Магикс", "Магистрина", "Магикер", "Магиза", "Мишуля", "Магистришка", "Гишоня", "Мишута", "Маганин", "Магинька", "Магистриша", "Магешка", "Магистрец", "Магиш", "Магикор", "Магнишка", "Магара", "Магита", "Магулька", "Магушка", "Магиняша", "Магистрашка", "Магиструшка", "Мишанин", "Магишечка", "Магистрессуля", "Магинёнок", "Магистрашечка", "Магистришечка", "Магир", "Магикашка", "Магистришуля", "Магирка", "Магикашечка", "Магишушка", "Магистрёнок", "Магирин", "Магистришечка", "Магиряшка", "Магинечка", "Магикаш")


VA_TBR = ('скажи', 'покажи', 'ответь', 'произнеси', 'расскажи', 'сколько', "Покажи", "Расскажи", "Ответь", "Посчитай", "Включи", "Выключи", "Найди", "Запусти", "Подбери", "Напомни", "Запиши", "Исправь", "Установи", "Удали", "Обнови", "Открой", "Закрой", "Скачай", "Переведи")

VA_CMD_LIST = {
    "help": ('список команд', 'команды', 'что ты умеешь', 'твои навыки', 'навыки'),
    "ctime": ('время', 'текущее время', 'сейчас времени', 'который час'),
    "joke": ('расскажи анекдот', 'рассмеши', 'шутка', 'расскажи шутку', 'пошути', 'развесели'),
    "open_browser": ('открой браузер', 'запусти браузер', 'открой гугл хром', 'гугл хром'),
    "block_sites": ("прекрати работу с интернет-ресурсом", "приостанови доступ к веб-сайту", "заблокируй сайт", "прекрати работу с веб-ресурсом", "приостанови доступ к адресу", "прекрати работу с ресурсом", "заблокируй доступ к сайту", "закрой доступ к веб-ресурсу", "прикрой доступ к интернет-ресурсу", "останови доступ к веб-сайту", "заблокируй работу с адресом", "приостанови работу с интернет-ресурсом", "ограничь доступ к сайту", "прикрой работу с веб-сайтом", "останови доступ к ресурсу", "приостанови работу с веб-ресурсом", "заблокируй работу с веб-сайтом", "ограничь работу с сайтом", "прекрати доступ к интернет-ресурсу", "приостанови работу с ресурсом", "заблокируй работу с интернет-ресурсом", "ограничь доступ к веб-ресурсу", "прикрой доступ к сайту", "останови работу с адресом"),
    "unblock_sites": ("разреши работу с интернет-ресурсом", "возобнови доступ к веб-сайту", "разблокируй сайт", "возобнови работу с веб-ресурсом", "разреши доступ к адресу", "возобнови работу с ресурсом", "разблокируй доступ к сайту", "открой доступ к веб-ресурсу", "разреши доступ к интернет-ресурсу", "возобнови доступ к веб-сайту", "разблокируй работу с адресом", "открой работу с интернет-ресурсом", "разреши доступ к сайту", "возобнови работу с веб-сайтом", "разблокируй доступ к ресурсу", "открой работу с веб-ресурсом", "разреши работу с веб-сайтом", "возобнови работу с сайтом", "разблокируй доступ к интернет-ресурсу", "открой работу с ресурсом", "разреши работу с интернет-ресурсом", "возобнови доступ к веб-ресурсу", "разблокируй работу с сайтом", "открой доступ к адресу")
}